NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/BGM21/BGM210LA22JNF.svd
        <register>
          <name>LEGACY</name>
          <description>This is the legacy device detection information for tools compatability</description>
          <addressOffset>0x1FC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00800000</resetValue>
          <resetMask>0x00FF0000</resetMask>
          <fields>
            <field>
              <name>DEVICEFAMILY</name>
              <description>Device Family</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EFR32MG1P</name>
                  <description>EFR32 Mighty Gecko Family Series 1 Device Config 1</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFR32MG1B</name>
                  <description>EFR32 Mighty Gecko Family Series 1 Device Config 1</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFR32MG1V</name>
                  <description>EFR32 Mighty Gecko Family Series 1 Device Config 1</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFR32BG1P</name>
                  <description>EFR32 Blue Gecko Family Series 1 Device Config 1</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFR32BG1B</name>
                  <description>EFR32 Blue Gecko Family Series 1 Device Config 1</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFR32BG1V</name>
                  <description>EFR32 Blue Gecko Family Series 1 Device Config 1</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFR32FG1P</name>
                  <description>EFR32 Flex Gecko Family Series 1 Device Config 1</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFR32FG1B</name>
                  <description>EFR32 Flex Gecko Family Series 1 Device Config 1</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFR32FG1V</name>
                  <description>EFR32 Flex Gecko Family Series 1 Device Config 1</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFR32MG12P</name>
                  <description>EFR32 Mighty Gecko Family Series 1 Device Config 2</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFR32MG12B</name>
                  <description>EFR32 Mighty Gecko Family Series 1 Device Config 2</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFR32MG12V</name>
                  <description>EFR32 Mighty Gecko Family Series 1 Device Config 2</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFR32BG12P</name>
                  <description>EFR32 Blue Gecko Family Series 1 Device Config 2</description>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFR32BG12B</name>
                  <description>EFR32 Blue Gecko Family Series 1 Device Config 2</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFR32BG12V</name>
                  <description>EFR32 Blue Gecko Family Series 1 Device Config 2</description>
                  <value>33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFR32FG12P</name>
                  <description>EFR32 Flex Gecko Family Series 1 Device Config 2</description>
                  <value>37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFR32FG12B</name>
                  <description>EFR32 Flex Gecko Family Series 1 Device Config 2</description>
                  <value>38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFR32FG12V</name>
                  <description>EFR32 Flex Gecko Family Series 1 Device Config 2</description>
                  <value>39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFR32MG13P</name>
                  <description>EFR32 Mighty Gecko Family Series 13 Device Config 3</description>
                  <value>40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFR32MG13B</name>
                  <description>EFR32 Mighty Gecko Family Series 13 Device Config 3</description>
                  <value>41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFR32MG13V</name>
                  <description>EFR32 Mighty Gecko Family Series 1 Device Config 3</description>
                  <value>42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFR32BG13P</name>
                  <description>EFR32 Blue Gecko Family Series 1 Device Config 3</description>
                  <value>43</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFR32BG13B</name>
                  <description>EFR32 Blue Gecko Family Series 1 Device Config 3</description>
                  <value>44</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFR32BG13V</name>
                  <description>EFR32 Blue Gecko Family Series 1 Device Config 3</description>
                  <value>45</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFR32FG13P</name>
                  <description>EFR32 Flex Gecko Family Series 1 Device Config 3</description>
                  <value>49</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFR32FG13B</name>
                  <description>EFR32 Flex Gecko Family Series 1 Device Config 3</description>
                  <value>50</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFR32FG13V</name>
                  <description>EFR32 Flex Gecko Family Series 1 Device Config 3</description>
                  <value>51</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFR32MG14P</name>
                  <description>EFR32 Mighty Gecko Family Series 1 Device Config 4</description>
                  <value>52</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFR32MG14B</name>
                  <description>EFR32 Mighty Gecko Family Series 1 Device Config 4</description>
                  <value>53</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFR32MG14V</name>
                  <description>EFR32 Mighty Gecko Family Series 1 Device Config 4</description>
                  <value>54</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFR32BG14P</name>
                  <description>EFR32 Blue Gecko Family Series 1 Device Config 4</description>
                  <value>55</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFR32BG14B</name>
                  <description>EFR32 Blue Gecko Family Series 1 Device Config 4</description>
                  <value>56</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFR32BG14V</name>
                  <description>EFR32 Blue Gecko Family Series 1 Device Config 4</description>
                  <value>57</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFR32FG14P</name>
                  <description>EFR32 Flex Gecko Family Series 1 Device Config 4</description>
                  <value>61</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFR32FG14B</name>
                  <description>EFR32 Flex Gecko Family Series 1 Device Config 4</description>
                  <value>62</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFR32FG14V</name>
                  <description>EFR32 Flex Gecko Family Series 1 Device Config 4</description>
                  <value>63</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFM32G</name>
                  <description>EFM32 Gecko Device Family</description>
                  <value>71</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFM32GG</name>
                  <description>EFM32 Giant Gecko Device Family</description>
                  <value>72</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFM32TG</name>
                  <description>EFM32 Tiny Gecko Device Family</description>
                  <value>73</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFM32LG</name>
                  <description>EFM32 Leopard Gecko Device Family</description>
                  <value>74</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFM32WG</name>
                  <description>EFM32 Wonder Gecko Device Family</description>
                  <value>75</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFM32ZG</name>
                  <description>EFM32 Zero Gecko Device Family</description>
                  <value>76</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFM32HG</name>
                  <description>EFM32 Happy Gecko Device Family</description>
                  <value>77</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFM32PG1B</name>
                  <description>EFM32 Pearl Gecko Device Family Series 1 Device Config 1</description>
                  <value>81</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFM32JG1B</name>
                  <description>EFM32 Jade Gecko Device Family Series 1 Device Config 1</description>
                  <value>83</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFM32PG12B</name>
                  <description>EFM32 Pearl Gecko Device Family Series 1 Device Config 2</description>
                  <value>85</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFM32JG12B</name>
                  <description>EFM32 Jade Gecko Device Family Series 1 Device Config 2</description>
                  <value>87</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFM32PG13B</name>
                  <description>EFM32 Pearl Gecko Device Family Series 1 Device Config 3</description>
                  <value>89</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFM32JG13B</name>
                  <description>EFM32 Jade Gecko Device Family Series 1 Device Config 3</description>
                  <value>91</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFM32GG11B</name>
                  <description>EFM32 Giant Gecko Device Family Series 1 Device Config 1</description>
                  <value>100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFM32TG11B</name>
                  <description>EFM32 Giant Gecko Device Family Series 1 Device Config 1</description>
                  <value>103</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EZR32LG</name>
                  <description>EZR32 Leopard Gecko Device Family</description>
                  <value>120</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EZR32WG</name>
                  <description>EZR32 Wonder Gecko Device Family</description>
                  <value>121</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EZR32HG</name>
                  <description>EZR32 Happy Gecko Device Family</description>
                  <value>122</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SERIES2V0</name>
                  <description>DI page is encoded with the series 2 layout. Check alternate location.</description>
                  <value>128</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
